{
  "sections": [
    {
      "title": "World",
      "stories": [
        {
          "headline": "US Supreme Court Strikes Down Trump's Global Tariffs",
          "body": "The US Supreme Court has ruled Trump's sweeping global tariffs illegal, dealing a major blow to the central plank of his second-term economic agenda. The decision has sent shockwaves through markets, with some Republican lawmakers quietly welcoming the ruling, reflecting intraparty tensions over trade policy. Trump called the decision \"deeply disappointing\" and is reportedly considering alternative ways to impose tariffs.,,",
          "sources": [
            {
              "name": "BBC",
              "url": "https://www.bbc.com/news"
            },
            {
              "name": "Guardian",
              "url": "https://www.theguardian.com/world"
            },
            {
              "name": "Reuters",
              "url": "https://www.reuters.com/world/"
            },
            {
              "name": "Al Jazeera",
              "url": "https://www.aljazeera.com/"
            },
            {
              "name": "NYT",
              "url": "https://www.nytimes.com/section/us"
            },
            {
              "name": "Washington Post",
              "url": "https://www.washingtonpost.com/national/"
            },
            {
              "name": "El Pais",
              "url": "https://elpais.com/espana/"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            }
          ]
        },
        {
          "headline": "Prince Andrew Arrested in Epstein Case",
          "body": "Former Prince Andrew has been arrested in connection with the Jeffrey Epstein case, with police searching his former home. The UK government is now considering removing him from the royal line of succession. The arrest marks a dramatic escalation in one of the most damaging royal scandals in modern British history, with calls growing for him to formally relinquish his position.,",
          "sources": [
            {
              "name": "BBC",
              "url": "https://www.bbc.com/news"
            },
            {
              "name": "Guardian",
              "url": "https://www.theguardian.com/world"
            },
            {
              "name": "Al Jazeera",
              "url": "https://www.aljazeera.com/"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            }
          ]
        },
        {
          "headline": "Iran Tensions Escalate as Trump Considers Limited Strike",
          "body": "Trump says he is considering a limited military strike on Iran to force negotiations on a nuclear deal, even as Iran describes the US military build-up in the region as \"unnecessary and unhelpful\" and insists a diplomatic deal is achievable. The rapid US military deployment near Iran continues to escalate tensions across the Middle East.",
          "sources": [
            {
              "name": "NYT",
              "url": "https://www.nytimes.com/section/us"
            },
            {
              "name": "Al Jazeera",
              "url": "https://www.aljazeera.com/"
            },
            {
              "name": "Guardian",
              "url": "https://www.theguardian.com/world"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            }
          ]
        },
        {
          "headline": "Israel Blocks Palestinian Access to Al-Aqsa for Ramadan",
          "body": "Israel has restricted Palestinian access to the Al-Aqsa Mosque compound for Ramadan Friday prayers, drawing condemnation from across the region. Meanwhile, Trump's \"Board of Peace\" for Gaza has been met with deep scepticism by Palestinians, and an Israeli settler killed a 19-year-old Palestinian American, according to officials and witnesses.",
          "sources": [
            {
              "name": "Al Jazeera",
              "url": "https://www.aljazeera.com/"
            },
            {
              "name": "AP",
              "url": "https://apnews.com/us-news"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            }
          ]
        },
        {
          "headline": "NASA Targets Early March for Artemis Moon Mission",
          "body": "NASA has announced it is targeting early March to send astronauts around the Moon on the Artemis mission, following a successful fueling test. The mission would mark the first human journey beyond low Earth orbit in over half a century.",
          "sources": [
            {
              "name": "BBC",
              "url": "https://www.bbc.com/news"
            },
            {
              "name": "AP",
              "url": "https://apnews.com/us-news"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            }
          ]
        }
      ]
    },
    {
      "title": "US",
      "stories": [
        {
          "headline": "Supreme Court Tariff Ruling Reshapes Economic Policy",
          "body": "Beyond the immediate legal defeat, the Supreme Court's tariff ruling could dash Trump's broader spending plans and reshape US trade policy for years to come. Apple is among the companies hardest hit, and the administration is scrambling to find alternative legal pathways to reimpose duties. Three dissenting justices warned the decision may unleash short-term economic chaos.",
          "sources": [
            {
              "name": "NYT",
              "url": "https://www.nytimes.com/section/us"
            },
            {
              "name": "Washington Post",
              "url": "https://www.washingtonpost.com/national/"
            },
            {
              "name": "AP",
              "url": "https://apnews.com/us-news"
            },
            {
              "name": "Politico",
              "url": "https://www.politico.com/"
            }
          ]
        },
        {
          "headline": "Federal Judge Accuses Administration of 'Terror' Against Immigrants",
          "body": "A federal judge has issued a scathing ruling accusing the Trump administration of conducting \"terror\" against immigrants, as another judge set a deadline for the administration to restore a slavery exhibit in Philadelphia that had been removed. The rulings add to growing judicial pushback against the administration's immigration enforcement.",
          "sources": [
            {
              "name": "AP",
              "url": "https://apnews.com/us-news"
            },
            {
              "name": "Washington Post",
              "url": "https://www.washingtonpost.com/national/"
            },
            {
              "name": "NYT",
              "url": "https://www.nytimes.com/section/us"
            }
          ]
        },
        {
          "headline": "California Avalanche Recovery Continues After Deadly Slide",
          "body": "Crews are hoping to resume recovery of eight bodies from a devastating California avalanche after days of dangerous weather conditions. Among the victims were six mothers who had bonded over a shared love of the outdoors. As investigations begin, questions are emerging about whether anyone was at fault.",
          "sources": [
            {
              "name": "AP",
              "url": "https://apnews.com/us-news"
            },
            {
              "name": "NYT",
              "url": "https://www.nytimes.com/section/us"
            },
            {
              "name": "Washington Post",
              "url": "https://www.washingtonpost.com/national/"
            }
          ]
        },
        {
          "headline": "ICE Enforcement Under Scrutiny After Crash Kills Teacher",
          "body": "A cherished teacher was killed in a crash involving a driver being pursued by ICE agents, sparking outrage and renewed debate over immigration enforcement tactics. Separately, police are investigating an ICE arrest in which a man suffered severe head injuries.",
          "sources": [
            {
              "name": "AP",
              "url": "https://apnews.com/us-news"
            },
            {
              "name": "NYT",
              "url": "https://www.nytimes.com/section/us"
            }
          ]
        }
      ]
    },
    {
      "title": "Spain",
      "stories": [
        {
          "headline": "Government Scrambles Over Co-official Language Requirement for Immigration",
          "body": "The Spanish government is trying to contain a political storm over whether knowledge of co-official languages like Catalan and Basque will be mandatory for immigrants seeking regularisation. After initially including language requirements, the government clarified they would not be required \"from the start\" but could help prove cultural ties. The Balearic government has asked for the decree to be withdrawn entirely.",
          "sources": [
            {
              "name": "El Pais",
              "url": "https://elpais.com/espana/"
            },
            {
              "name": "El Mundo",
              "url": "https://www.elmundo.es/espana.html"
            },
            {
              "name": "RTVE",
              "url": "https://www.rtve.es/noticias/espana/"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            }
          ]
        },
        {
          "headline": "Man Kills Son and Injures Partner in Tenerife",
          "body": "A man killed his 10-year-old son and seriously injured his partner in Arona, Tenerife, before being shot dead by the Guardia Civil. The case adds to a grim week of domestic violence in Spain, with five people including two children killed in just four days, prompting the Equality Ministry to admit failures in risk assessment protocols.",
          "sources": [
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            },
            {
              "name": "RTVE",
              "url": "https://www.rtve.es/noticias/espana/"
            }
          ]
        },
        {
          "headline": "Mazon's Driver Testifies Dana Alert Sounded While Still in Valencia",
          "body": "The driver of Valencia's regional president Mazon has testified before a judge that the emergency alert (Es-Alert) during last year's deadly dana flooding sounded on their phone while they were still in central Valencia, heading to the emergency coordination centre. The testimony is key to establishing the timeline of the government's response to the disaster that killed over 200 people.",
          "sources": [
            {
              "name": "El Pais",
              "url": "https://elpais.com/espana/"
            },
            {
              "name": "El Mundo",
              "url": "https://www.elmundo.es/espana.html"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            }
          ]
        },
        {
          "headline": "Spain Asks EU to Lift Sanctions on Venezuelan Official After Amnesty",
          "body": "The Spanish government has rushed to ask the EU to lift sanctions on Venezuelan vice-president Delcy Rodriguez, just hours after Venezuela approved an amnesty law. The move was criticised by Foreign Minister Albares' own allies, with some calling it an \"error.\"",
          "sources": [
            {
              "name": "El Pais",
              "url": "https://elpais.com/espana/"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            }
          ]
        }
      ]
    },
    {
      "title": "Barcelona & Catalunya",
      "stories": [
        {
          "headline": "Sagrada Familia Reaches Its Maximum Height",
          "body": "The Sagrada Familia has placed the final piece atop the Tower of Jesus, reaching its maximum height of 172.5 metres -- 144 years after the first stone was laid. The milestone was celebrated across Barcelona, with the crowned basilica now visible from vantage points across the entire city. The Senyera and Vatican flag now fly from the summit.",
          "sources": [
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            },
            {
              "name": "beteve",
              "url": "https://beteve.cat/"
            },
            {
              "name": "Tot Barcelona",
              "url": "https://www.totbarcelona.cat/"
            }
          ]
        },
        {
          "headline": "Rodalies Still Struggling a Month After Gelida Accident",
          "body": "A month after the Gelida rail accident, Rodalies commuter trains continue to operate with significant disruptions. Some 200 track sections will have speed limitations next week, half caused by the emergency repair works. Adif now expects to lift 90% of the speed restrictions by the end of April.",
          "sources": [
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            }
          ]
        },
        {
          "headline": "Pisarello Wins Barcelona en Comu Primary",
          "body": "Gerardo Pisarello has won the Barcelona en Comu primary election, beating Bob Pop to become the party's candidate for mayor. He pledged to build \"a Barcelona at the service of everyone, not just a few.\"",
          "sources": [
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/barcelona-ciutat/"
            },
            {
              "name": "beteve",
              "url": "https://beteve.cat/"
            }
          ]
        },
        {
          "headline": "Illa Commits to IRPF Tax Collection to Unlock ERC Budget Deal",
          "body": "Catalan president Salvador Illa has told ERC his commitment to taking over income tax (IRPF) collection in Catalunya is \"total,\" a key concession aimed at securing ERC's support for the regional budget. The deal could reshape Catalan fiscal autonomy.",
          "sources": [
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            },
            {
              "name": "3cat",
              "url": "https://www.3cat.cat/3catinfo/"
            },
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/"
            }
          ]
        },
        {
          "headline": "Housing Speculation Rules Threaten Barcelona Renovation Projects",
          "body": "New regulations aimed at curbing housing speculation in Barcelona are threatening rehabilitation and renovation projects across the city. The real estate sector fears the rules will further reduce the already tight rental supply in Catalunya.",
          "sources": [
            {
              "name": "El Periodico",
              "url": "https://www.elperiodico.com/es/barcelona/"
            },
            {
              "name": "La Vanguardia",
              "url": "https://www.lavanguardia.com/"
            }
          ]
        }
      ]
    }
  ]
}