{
  "sections": [
    {
      "title": "Spain",
      "stories": [
        {
          "headline": "Spain to Investigate Social Media Giants Over AI-Generated Child Abuse Material",
          "body": "Prime Minister Pedro Sánchez announced that his government will ask prosecutors to investigate X, Meta, and TikTok for allegedly spreading AI-generated child sexual abuse material. The move escalates the growing transatlantic clash between Europe and the US over tech regulation, coming just weeks after Spain announced plans to ban social media for under-16s.",
          "sources": [
            {
              "name": "NY Times",
              "url": "https://nytimes.com/2026/02/17/world/europe/spain-investigate-social-media.html"
            }
          ]
        },
        {
          "headline": "Five Teenagers Killed in Apartment Fire in Manlleu, Near Barcelona",
          "body": "Five young people died and five others were injured in a devastating fire at a five-story apartment building in Manlleu, a town of 21,000 north of Barcelona. The victims were found in an attic storage room, burned beyond recognition. Police confirmed the deaths were caused by smoke inhalation and the fire appears to have been accidental, sparked by a fast-combustion material. The town hall was unaware the rooftop storage room was being used as a gathering spot by local youth.",
          "sources": [
            {
              "name": "Mirror",
              "url": "https://www.mirror.co.uk/news/world-news/breaking-five-killed-spain-apartment-36733200"
            }
          ]
        },
        {
          "headline": "Nationwide Doctors' Strike Begins Across Spain",
          "body": "Doctors across Spain began the first in a series of five-day nationwide strikes on Monday, with further dates planned through June. Medical unions are demanding legislation tailored to their unique working conditions, including regulation of 24-hour shifts and improved salaries. The previous strike in January had a patchy response.",
          "sources": [
            {
              "name": "The Olive Press",
              "url": "https://www.theolivepress.es/spain-news/2026/02/16/nationwide-doctors-strike-begins-today-in-spain-heres-how-it-could-affect-you/"
            }
          ]
        },
        {
          "headline": "Spain Carves a Different Path on Immigration with Amnesty Program",
          "body": "Spain's center-left government is offering hundreds of thousands of undocumented immigrants a path to legal status, betting that the country's rock-bottom birthrate and shrinking workforce make migration essential. The opposition Popular Party warns it will overwhelm public services, while far-right Vox says it \"attacks our identity.\"",
          "sources": [
            {
              "name": "NY Times",
              "url": "https://www.nytimes.com/2026/02/16/world/europe/spain-amnesty-immigration.html"
            }
          ]
        },
        {
          "headline": "High-Speed Rail Between Madrid and Andalusia Resumes After Deadly Crash",
          "body": "High-speed trains between Madrid and Andalusia have resumed service, one month after a devastating collision that killed 46 people. Meanwhile, a CIS survey shows 84% of Spaniards believe the Constitution needs reform, with 66% wanting \"significant\" changes.",
          "sources": [
            {
              "name": "The Local",
              "url": "https://www.thelocal.es/20260217/today-in-spain-a-roundup-of-the-latest-news-on-tuesday-67"
            }
          ]
        }
      ]
    },
    {
      "title": "Barcelona & Catalunya",
      "stories": [
        {
          "headline": "FC Barcelona Lose La Liga Lead After 2-1 Defeat to Girona",
          "body": "Barcelona surrendered the top spot in La Liga after a 2-1 defeat to Girona at Montilivi on Monday night. Despite reaching 100 goals this season, a controversial late winner from Girona's Fran Beltrán sealed the loss. Coach Hansi Flick vowed to \"fight back to our best\" as pressure mounts with March bringing decisive Champions League and Copa del Rey fixtures.",
          "sources": [
            {
              "name": "Barca Blaugranes",
              "url": "https://www.barcablaugranes.com/barcelona-news/112987/fc-barcelona-news-17-february-2026-barca-surrender-top-spot-in-la-liga-with-defeat-to-girona"
            }
          ]
        },
        {
          "headline": "Barcelona F1 Grand Prix Secured Until 2032",
          "body": "The Circuit de Barcelona-Catalunya will remain on the F1 calendar through 2032, alternating with the Belgian Grand Prix at Spa. The deal secures races in 2026, 2028, 2030, and 2032, despite the addition of a new Madrid street race. A fan festival at Placa de Catalunya will return for the June 12-14 race weekend.",
          "sources": [
            {
              "name": "Sky Sports",
              "url": "https://www.skysports.com/f1/news/12040/13508256/barcelona-to-remain-on-f1-calendar-until-2032-in-rotation-with-belgian-grand-prix-despite-addition-of-madrid-race"
            }
          ]
        },
        {
          "headline": "Manlleu Fire: Five Adolescents Dead in Rooftop Blaze",
          "body": "In the most tragic local story, five teenagers died in a fire at a residential building in Manlleu (Osona comarca, about 75km north of Barcelona). The Mossos d'Esquadra confirmed the victims died of smoke inhalation in what appears to be an accidental fire in a rooftop storage room that local youth had been using as a hangout.",
          "sources": [
            {
              "name": "El Confidencial",
              "url": "https://www.elconfidencial.com/espana/cataluna/2026-02-17/incendio-manlleu-barcelona-mueren-cinco-cataluna_4304464/"
            }
          ]
        },
        {
          "headline": "Storm Season Aftermath: Catalonia Recovers from Weeks of Extreme Weather",
          "body": "After weeks of successive storms battering the region — including Nils, Marta, Leonardo, and Oriana — Catalonia is finally seeing calmer weather. The storms caused school closures across Catalonia, injured around 90 people, and generated hurricane-force winds exceeding 140 km/h. The Barcelones and Baix Llobregat comarcas were among the hardest hit, with hundreds of emergency calls logged.",
          "sources": [
            {
              "name": "News.az",
              "url": "https://news.az/news/deadly-winds-injure-dozens-in-spain-red-alert-in-valencia"
            }
          ]
        }
      ]
    }
  ]
}